修复部分BUG
